### Series

#### Diif bw list and series
1.Homogeneity: A Pandas series requires all data elements to be of the same data type, while a Python list can contain elements   of different data types.
2.Memory efficiency: Pandas series are more memory efficient than Python lists because they use NumPy arrays internally, which     are more compact and faster for numerical computations.                                               
3.Vectorization: Pandas series support vectorized operations that allow us to perform calculations on entire sequences of data     at once, making data processing faster and more efficient. Python lists, on the other hand, do not support vectorized           operations.

In [1]:
import numpy as np
import pandas as pd

In [4]:
friends= ['suresh', 'sai', 'param','chaitu']

ages = [26, 25, 27,26]

arr = np.array([26, 25, 27,26])

fg= {'suresh':26, 'sai':25, 'param':27,'chaitu':26}

In [5]:
type(arr)

numpy.ndarray

In [6]:
type(fg)

dict

In [9]:
f=pd.Series(friends)
f

0    suresh
1       sai
2     param
3    chaitu
dtype: object

In [10]:
type(f)

pandas.core.series.Series

In [11]:
friage=pd.Series(ages,index=friends)
friage

suresh    26
sai       25
param     27
chaitu    26
dtype: int64

In [12]:
friage[0] #using numerical index to acessing a element

26

In [13]:
friage[-1]

26

In [14]:
friage['sai']#using key to acessing a element

25

In [15]:
friage['chaitu']

26

In [16]:
#pandas series is highly flexible
#numpy contains only strings or integers or booleans
pd.Series([len,min,max])

0    <built-in function len>
1    <built-in function min>
2    <built-in function max>
dtype: object

#### DataFrame

In [17]:
r= ['suresh', 'sai', 'param','chaitu']

c= ['A', 'B', 'C', 'D', 'E']

In [23]:
data = np.round(np.random.rand(4,5),2)
data

array([[0.29, 0.28, 0.05, 0.39, 0.86],
       [0.33, 0.88, 0.69, 0.15, 0.64],
       [0.01, 0.27, 0.36, 0.89, 0.33],
       [0.88, 0.84, 0.1 , 0.79, 0.91]])

In [26]:
df=pd.DataFrame(data,r,c)
df

           A     B     C     D     E
suresh  0.29  0.28  0.05  0.39  0.86
sai     0.33  0.88  0.69  0.15  0.64
param   0.01  0.27  0.36  0.89  0.33
chaitu  0.88  0.84  0.10  0.79  0.91

In [28]:
#Creating a data frame at one step
pd.DataFrame((np.round(np.random.rand(4,5),2)),['suresh','sai','param','chaitu'],['A','B','C','D','E'])

           A     B     C     D     E
suresh  0.47  0.51  0.54  0.64  0.65
sai     0.12  0.45  0.07  0.50  0.77
param   0.94  0.92  0.58  0.38  0.24
chaitu  0.42  0.41  0.44  0.14  0.96

#### The Relationship Between Pandas Series and Pandas DataFrame
The above dataframe contains 4 rows and 5 columns.each of these columns is actually a pandas Series

In [35]:
df['A']#acessing entire A column

suresh    0.29
sai       0.33
param     0.01
chaitu    0.88
Name: A, dtype: float64

In [32]:
df.iloc[1]#acessing entire sai row

A    0.33
B    0.88
C    0.69
D    0.15
E    0.64
Name: sai, dtype: float64

#### Indexing and Assignment in Pandas DataFrames

In [36]:
df["A"]

suresh    0.29
sai       0.33
param     0.01
chaitu    0.88
Name: A, dtype: float64

In [37]:
df['E']

suresh    0.86
sai       0.64
param     0.33
chaitu    0.91
Name: E, dtype: float64

In [41]:
df[['A','E']]

           A     E
suresh  0.29  0.86
sai     0.33  0.64
param   0.01  0.33
chaitu  0.88  0.91

In [42]:
df[['B','A']]

           B     A
suresh  0.28  0.29
sai     0.88  0.33
param   0.27  0.01
chaitu  0.84  0.88

In [43]:
df['A+E']=df['A']+df['E']
df

           A     B     C     D     E   A+E
suresh  0.29  0.28  0.05  0.39  0.86  1.15
sai     0.33  0.88  0.69  0.15  0.64  0.97
param   0.01  0.27  0.36  0.89  0.33  0.34
chaitu  0.88  0.84  0.10  0.79  0.91  1.79

In [44]:
df['B-A']=df['B']-df['A']
df

           A     B     C     D     E   A+E   B-A
suresh  0.29  0.28  0.05  0.39  0.86  1.15 -0.01
sai     0.33  0.88  0.69  0.15  0.64  0.97  0.55
param   0.01  0.27  0.36  0.89  0.33  0.34  0.26
chaitu  0.88  0.84  0.10  0.79  0.91  1.79 -0.04

In [46]:
#droping entire multiple columns
df=df.drop(['A+E','B-A'],axis=1)
df

           A     B     C     D     E
suresh  0.29  0.28  0.05  0.39  0.86
sai     0.33  0.88  0.69  0.15  0.64
param   0.01  0.27  0.36  0.89  0.33
chaitu  0.88  0.84  0.10  0.79  0.91

In [49]:
#droping entire row
df.drop('chaitu')

           A     B     C     D     E
suresh  0.29  0.28  0.05  0.39  0.86
sai     0.33  0.88  0.69  0.15  0.64
param   0.01  0.27  0.36  0.89  0.33

In [48]:
df

           A     B     C     D     E
suresh  0.29  0.28  0.05  0.39  0.86
sai     0.33  0.88  0.69  0.15  0.64
param   0.01  0.27  0.36  0.89  0.33
chaitu  0.88  0.84  0.10  0.79  0.91

#### To Select A Row From A Pandas DataFrame

In [75]:
df

           A     B     C     D     E
suresh  0.29  0.28  0.05  0.39  0.86
sai     0.33  0.88  0.69  0.15  0.64
param   0.01  0.27  0.36  0.89  0.33
chaitu  0.88  0.84  0.10  0.79  0.91

In [77]:
df2

      A     B     C     D     E
0  0.46  0.70  0.04  0.46  0.68
1  0.16  0.95  0.90  0.70  0.31
2  0.08  0.46  0.88  0.31  0.27
3  0.49  0.16  0.29  0.74  0.68

In [78]:
"""The iloc() function is an indexed-based selecting method which means that we have to pass an integer 
index in the method to select a specific row/column."""
df2.iloc[1:3,2:5]

      C     D     E
1  0.90  0.70  0.31
2  0.88  0.31  0.27

In [79]:
"""The loc() function is label based data selecting method which means 
that we have to pass the name of the row or column which we want to select"""
df.loc['suresh']

A    0.29
B    0.28
C    0.05
D    0.39
E    0.86
Name: suresh, dtype: float64

#### Determine The Number Of Rows and Columns in a Pandas DataFrame

In [83]:
df.shape
#df contains 4 row and 5 columns

(4, 5)

In [84]:
df2.shape

(4, 5)

#### Slicing Pandas DataFrames

In [86]:
df[['A','B']]#selecting particular columns

           A     B
suresh  0.29  0.28
sai     0.33  0.88
param   0.01  0.27
chaitu  0.88  0.84

In [87]:
df[['A','B']].loc[['suresh','chaitu']]#selecting particular columns and rows

           A     B
suresh  0.29  0.28
chaitu  0.88  0.84

#### Conditional Selection Using Pandas DataFrame

In [88]:
df[df>0.5]

           A     B     C     D     E
suresh   NaN   NaN   NaN   NaN  0.86
sai      NaN  0.88  0.69   NaN  0.64
param    NaN   NaN   NaN  0.89   NaN
chaitu  0.88  0.84   NaN  0.79  0.91

In [89]:
df[df<0.5]#getting values

           A     B     C     D     E
suresh  0.29  0.28  0.05  0.39   NaN
sai     0.33   NaN   NaN  0.15   NaN
param   0.01  0.27  0.36   NaN  0.33
chaitu   NaN   NaN  0.10   NaN   NaN

In [90]:
df<0.5#getting boolean values

            A      B      C      D      E
suresh   True   True   True   True  False
sai      True  False  False   True  False
param    True   True   True  False   True
chaitu  False  False   True  False  False

In [92]:
df['A']<0.5

suresh     True
sai        True
param      True
chaitu    False
Name: A, dtype: bool

In [97]:
df['E']<0.5

suresh    False
sai       False
param      True
chaitu    False
Name: E, dtype: bool

In [98]:
df

           A     B     C     D     E
suresh  0.29  0.28  0.05  0.39  0.86
sai     0.33  0.88  0.69  0.15  0.64
param   0.01  0.27  0.36  0.89  0.33
chaitu  0.88  0.84  0.10  0.79  0.91

In [100]:
df[(df['A']<0.8)&(df['A']>0.3)]

        A     B     C     D     E
sai  0.33  0.88  0.69  0.15  0.64

In [101]:
df[(df['A']<0.8)&(df['D']>0.5)]

          A     B     C     D     E
param  0.01  0.27  0.36  0.89  0.33

#### Modify The Index

In [102]:
df

           A     B     C     D     E
suresh  0.29  0.28  0.05  0.39  0.86
sai     0.33  0.88  0.69  0.15  0.64
param   0.01  0.27  0.36  0.89  0.33
chaitu  0.88  0.84  0.10  0.79  0.91

In [109]:
df.drop('level_0',axis=1,inplace=True)
df

    index     A     B     C     D     E
0  suresh  0.29  0.28  0.05  0.39  0.86
1     sai  0.33  0.88  0.69  0.15  0.64
2   param  0.01  0.27  0.36  0.89  0.33
3  chaitu  0.88  0.84  0.10  0.79  0.91

#### Rename Columns

In [110]:
df.columns

Index(['index', 'A', 'B', 'C', 'D', 'E'], dtype='object')

In [111]:
df.columns=['Sname','telugu','english','maths','science','social']

In [112]:
df

    Sname  telugu  english  maths  science  social
0  suresh    0.29     0.28   0.05     0.39    0.86
1     sai    0.33     0.88   0.69     0.15    0.64
2   param    0.01     0.27   0.36     0.89    0.33
3  chaitu    0.88     0.84   0.10     0.79    0.91

In [126]:
df['Sname']=['Sai','Suresh','Param','Chaitu']#Renaming column values
df

    Sname  telugu  english  maths  science  social
0     Sai    0.29     0.28   0.05     0.39    0.86
1  Suresh    0.33     0.88   0.69     0.15    0.64
2   Param    0.01     0.27   0.36     0.89    0.33
3  Chaitu    0.88     0.84   0.10     0.79    0.91

In [129]:
df['Sname']=='Chaitu'

0    False
1    False
2    False
3     True
Name: Sname, dtype: bool

#### Deal With Missing Data

In [3]:
df=pd.DataFrame(np.array([[1,2,3],[4,np.nan,6],[np.nan,np.nan,9]]))
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  NaN  9.0

In [5]:
df.columns=['A','B','C']
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  NaN  6.0
2  NaN  NaN  9.0

In [6]:
#Using dropna :row consists atleast one null value default it removes entire row
df.dropna()

     A    B    C
0  1.0  2.0  3.0

In [8]:
df.dropna(axis=1)#dropna() works on column wise

     C
0  3.0
1  6.0
2  9.0

In [10]:
#fillna():it removes all null values in dataframe and replacing given value
df.fillna(' ')

     A    B    C
0  1.0  2.0  3.0
1  4.0       6.0
2            9.0

In [11]:
df.fillna(df.mean())

     A    B    C
0  1.0  2.0  3.0
1  4.0  2.0  6.0
2  2.5  2.0  9.0

In [12]:
df["A"].fillna(df["A"].mean())#Column wise operationsd

0    1.0
1    4.0
2    2.5
Name: A, dtype: float64

#### Groupby Method

In [43]:
df=pd.DataFrame([['suresh','sw',26],['param','others',27],['sai','others',26],['chaitu','sw',26],['mani','sw',28]])
df

        0       1   2
0  suresh      sw  26
1   param  others  27
2     sai  others  26
3  chaitu      sw  26
4    mani      sw  28

In [44]:
df.columns=['name','job','age']
df

     name     job  age
0  suresh      sw   26
1   param  others   27
2     sai  others   26
3  chaitu      sw   26
4    mani      sw   28

In [45]:
df.groupby('job')

In [25]:
import warnings
warnings.filterwarnings('ignore')

In [46]:
df.groupby('job').mean()

              age
job
others  26.500000
sw      26.666667

In [47]:
df.groupby('job').median()

         age
job
others  26.5
sw      26.0

In [48]:
df.groupby('age').sum()

                name         job
age
26   sureshsaichaitu  swotherssw
27             param      others
28              mani          sw

In [51]:
df.groupby('name').describe()

         age
       count  mean std   min   25%   50%   75%   max
name
chaitu   1.0  26.0 NaN  26.0  26.0  26.0  26.0  26.0
mani     1.0  28.0 NaN  28.0  28.0  28.0  28.0  28.0
param    1.0  27.0 NaN  27.0  27.0  27.0  27.0  27.0
sai      1.0  26.0 NaN  26.0  26.0  26.0  26.0  26.0
suresh   1.0  26.0 NaN  26.0  26.0  26.0  26.0  26.0

In [50]:
df.groupby('job').describe()

         age
       count       mean       std   min    25%   50%    75%   max
job
others   2.0  26.500000  0.707107  26.0  26.25  26.5  26.75  27.0
sw       3.0  26.666667  1.154701  26.0  26.00  26.0  27.00  28.0

#### Concat Method
1.DataFrame concatenation is quite similar. It means adding one DataFrame to the end of another DataFrame.              
2.In order for us to perform string concatenation, we should have two DataFrames with the same columns.

In [55]:
df1=pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],

                  'B': ['B0', 'B1', 'B2', 'B3'],

                  'C': ['C0', 'C1', 'C2', 'C3'],

                  'D': ['D0', 'D1', 'D2', 'D3']},

                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [56]:
df2=pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],

                  'B': ['B4', 'B5', 'B6', 'B7'],

                  'C': ['C4', 'C5', 'C6', 'C7'],

                  'D': ['D4', 'D5', 'D6', 'D7']},

                        index=[0, 1, 2, 3])
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [57]:
df3=pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],

                  'B': ['B8', 'B9', 'B10', 'B11'],

                  'C': ['C8', 'C9', 'C10', 'C11'],

                  'D': ['D8', 'D9', 'D10', 'D11']},

                        index=[0, 1, 2, 3])
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [61]:
pd.concat([df1,df2,df3],axis=0)#if you have same column names then adding rows

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [62]:
pd.concat([df1,df2,df3],axis=1)#if you have different column names then adding columns

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

#### Merge
You can merge two pandas DataFrames we have common columns in both tables

In [63]:
ld= pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                     'A': ['A0', 'A1', 'A2', 'A3'],

                     'B': ['B0', 'B1', 'B2', 'B3']})

   

rd= pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                          'C': ['C0', 'C1', 'C2', 'C3'],

                          'D': ['D0', 'D1', 'D2', 'D3']})

In [64]:
ld

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [65]:
rd

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [68]:
pd.merge(df1,df2,how='outer')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [73]:
pd.merge(ld,rd,how='inner')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

#### Join
we perform join operation then adding columns

In [78]:
df

     name     job  age
0  suresh      sw   26
1   param  others   27
2     sai  others   26
3  chaitu      sw   26
4    mani      sw   28

In [79]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [77]:
df.join(df1)

     name     job  age    A    B    C    D
0  suresh      sw   26   A0   B0   C0   D0
1   param  others   27   A1   B1   C1   D1
2     sai  others   26   A2   B2   C2   D2
3  chaitu      sw   26   A3   B3   C3   D3
4    mani      sw   28  NaN  NaN  NaN  NaN

In [80]:
df1.join(df)

    A   B   C   D    name     job  age
0  A0  B0  C0  D0  suresh      sw   26
1  A1  B1  C1  D1   param  others   27
2  A2  B2  C2  D2     sai  others   26
3  A3  B3  C3  D3  chaitu      sw   26

In [81]:
df

     name     job  age
0  suresh      sw   26
1   param  others   27
2     sai  others   26
3  chaitu      sw   26
4    mani      sw   28

#### Unique

In [82]:
df['name'].unique()#finding unique values

array(['suresh', 'param', 'sai', 'chaitu', 'mani'], dtype=object)

In [83]:
df['job'].unique()

array(['sw', 'others'], dtype=object)

In [84]:
df['name'].nunique()

5

In [85]:
df['age'].nunique()

3

#### Count The Occurence of Each Value

In [86]:
df['name'].value_counts()

suresh    1
param     1
sai       1
chaitu    1
mani      1
Name: name, dtype: int64

In [87]:
df['age'].value_counts()

26    3
27    1
28    1
Name: age, dtype: int64

#### apply Method
It is used to to perform any operation on entire column using function

In [88]:
def loki(x):
    a=x*2
    return a

In [89]:
df['age'].apply(loki)

0    52
1    54
2    52
3    52
4    56
Name: age, dtype: int64

In [91]:
df['name'].apply(len)

0    6
1    5
2    3
3    6
4    4
Name: name, dtype: int64

In [95]:
df['job'].apply(len)

0    2
1    6
2    6
3    2
4    2
Name: job, dtype: int64

#### Sort A Pandas DataFrame

In [96]:
df.sort_values('name')

     name     job  age
3  chaitu      sw   26
4    mani      sw   28
1   param  others   27
2     sai  others   26
0  suresh      sw   26

In [97]:
df.sort_values('age')

     name     job  age
0  suresh      sw   26
2     sai  others   26
3  chaitu      sw   26
1   param  others   27
4    mani      sw   28

#### -------------------------------------------------------------------------------------END--------------------------------------------------------------------------------------------